from .. import *


@sbb_b.ar_cmd(pattern="الاوامر")
async def hi(event):
    await edit_or_reply(
        event,
        "**[ . ᯏ𝖩𝗆𝗍𝗁𝗈ꪀ - ᥴ𝗆𝖽 ᭡ .](t.me/jmthon)\n✦┅━╍━╍╍━━╍━━╍━┅✦**\n\n**- مرحبا بك عزيز المستخدم هذه هي قائمة اوامر السورس **\n\n`.الامر1` ◂ اوامر الأدمن\n`.الامر2` ◂ اوامر المجموعة\n`.م3` ◂ اوامر الترحيب\n`.م4` ◂ اوامر الردود\n`.م5` ◂ اوامر الترفيه\n`.م6` ◂ اوامر حماية الخاص\n`.م7` ◂ اوامر الاذاعه و الكشف \n`.م8` ◂ اوامر البوت \n`.م9` ◂ اوامر المنع والترجمه\n`.م10` ◂ اوامر التلكراف و النطق\n`.م11` ◂ اوامر التحميل\n`.م12` ◂ اوامر التكرار\n`.م13` ◂ اوامر الانتحال والتقليد\n`.م14` ◂ اوامر الوقتي \n`.م15` ◂ اوامر الذاتيه والاضافه\n`.م16` ◂ اوامر البروفايل\n`.م17` ◂ اوامر الأكسترا\n`.م18` ◂ التاك و الملفات\n`.م19` ◂  اوامر الصيغ\n`.م20` ◂  اوامر التسلية\n`.م21` ◂  اوامر الفارات",
        link_preview=False,
    )


@sbb_b.ar_cmd(pattern="اوامر التحكم")
async def hi(event):
    await edit_or_reply(
        event,
        "**[ . ᯏ𝖩𝗆𝗍𝗁𝗈ꪀ - ᥴ𝗆𝖽 ᭡ .](t.me/jmthon)**\n✦┅━╍━╍╍━━╍━━╍━┅✦\n\n• اوامر التحكم تتيح لمستخدم اخر ان يستخدم اوامر تنصيبك وهو غير منصب جمثون حيث سيصبح متحكم في اوامر تنصيبك يرجى الانتباه من انه سيحصل على صلاحيات الاوامر  وقد يسبب خطورة لك اذا كنت لا تثق في المستخدم الذي اضفته. \n\n\n`.التحكم` تفعيل/تعطيل\n• تستخدم هذه الميزة لتفعيل/لتعطيل خاصية التحكم بأوامر تنصيبك للمستخدمين الذين أضفتهم في قائمة المتحكمين\n\n`.المتحكمين`\n• لعرض المستخدمين الذين اضفتهم الى قائمة المستخدمين المتحكمين\n\n`.اضف متحكم`\n• بالرد على المستخدم لأضافته متحكم في تنصيب جمثون الخاص بك\n\n`.ازالة متحكم`\n• بالرد على المستخدم لازالته من قائمة المتحكمين",
        link_preview=False,
    )
